receiving
highness
amir
kuwait
excellency
president
finland
october
march
zealand
commonwealth
heads
meeting
november
attach
importance
nato's
adaptation
changing
wider
protecting
throughout
budapest
summit
december
conflict
prevention
resolution
conventional
armed
forces
kingdom's
deterrent
settlement
yugoslavia
preventing
weapons
mass
destruction
remains
indefinite
unconditional
extension
non-proliferation
pursue
energetically
verifiable
ban
fight
terrorism
elsewhere
enlargement
january
partners
substance
central
aim
preparing
eventual
membership
concluding
gatt
establishment
world
organisation
ensure
subsidiarity
applied
budgetary
discipline
combat
fraud
participate
study
june
prepare
1996
inter-governmental
respect
human
rights
substantial
sustainable
development
celebrate
fiftieth
anniversary
capabilities
particularly
peacekeeping
preventive
diplomacy
active
tackling
misuse
trafficking
organised
crime
home
abroad
consolidation
stable
long-term
prosperity
china
sino-british
joint
declaration
smooth
transition
1997
communist
middle
stronger
pacific
region
estimates
changes
community's
resources
following
council
firm
financial
designed
continuing
growth
rising
employment
based
permanently
inflation
fiscal
policy
deficit
towards
balance
medium
reduce
share
income
enterprise
labour
market
supply
performance
increased
competition
gas
industry
agricultural
tenancy
laws
jobseeker's
allowance
reforming
benefits
unemployed
giving
help
equalise
women
choice
non-state
pensions
programmes
responsive
individual
citizen's
charter
tackle
discrimination
disabled
improvements
management
health
service;
provide
serious
disorder
discharged
hospital
cared
supervision
transfer
crown
agents
commercial
activities
atomic
energy
authority
sector;
authorise
construction
speed
rail
link
london
channel
tunnel
delivery
strengthened
agencies
scotland
scottish
criminal
justice
northern
build
progress
secure
accommodation
founded
consent
uphold
strive
opportunity
sections
close
constructive
relations
republic
pray
blessing
almighty
god
counsels
duke
south
africa
process
allow
play
role
stability
enhance
conference
co-operation
implementation
maintained
efforts
peaceful
former
proliferation
priority
negotiations
comprehensive
kingdom
agreements
trade
1995
programme
nations
drug
democracy
remain
hong
kong
develop
political
economic
asia
service
laid
force
system
set
budget
term
economy
england
wales
bill
create
pension
equality
citizen
line
principles
mental
private
establish
ireland
community
measures
lords
edinburgh
visit
national
environment
treaty
nuclear
principle
ties
public
agreement
policies
bring
sector
improve
strengthen
operation
law
house
commons
look
security
united
european
union
countries
support
implement
people
low
age
seek
maintain
reform
peace
introduced
forward
introduce
promote
legislation
continue
europe
government
